---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.LandingShapeHandleOnPinnedRunFailure
source: html/95e79a75-f45b-7239-c779-80e9f04a5fc2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.LandingShapeHandleOnPinnedRunFailure Property

Cannot Drag the automatic landing shape handle control because the connected run is pinned.

## Syntax (C#)
```csharp
public static FailureDefinitionId LandingShapeHandleOnPinnedRunFailure { get; }
```